import dedent from "dedent";

export const privacyData = [
    {
        title: "基本方針",
        text: "当サイトは、個人情報の重要性を認識し、個人情報を保護することが社会的責務であると考え、個人情報に関する法令を遵守し、当サイトで取扱う個人情報の取得、利用、管理を適正に行います。",
    },
    {
        title: "適用範囲",
        text: "本プライバシーポリシーは、お客様の個人情報もしくはそれに準ずる情報を取り扱う際に、当サイトが遵守する方針を示したものです。",
    },
    {
        title: "個人情報の利用目的",
        text: "当サイトは、お客様からご提供いただく情報を以下の目的の範囲内において利用します。",
        list: [
            "ご本人確認のため",
            "お問い合わせ、コメント等の確認・回答のため",
            "サービスの提供・改善・開発・マーケティングのため",
            "その他個別に承諾いただいた目的",
        ],
    },
    {
        title: "個人情報の管理",
        text: dedent`当サイトは、個人情報の正確性及び安全確保のために、セキュリティ対策を徹底し、個人情報の漏洩、改ざん、不正アクセスなどの危険については、必要かつ適切なレベルの安全対策を実施します。
        当サイトは、第三者に重要な情報を読み取られたり、改ざんされたりすることを防ぐために、SSLによる暗号化を使用しております。`
    },
    {
        title: "個人情報の第三者提供",
        text: "当サイトは、以下を含む正当な理由がある場合を除き、個人情報を第三者に提供することはありません。",
        list: [
            "ご本人の同意がある場合",
            "法令に基づく場合",
            "人の生命・身体・財産の保護に必要な場合",
            "公衆衛生・児童の健全育成に必要な場合",
            "国の機関等の法令の定める事務への協力の場合（税務調査、統計調査等）",
        ],
    },
    {
        title: "個人情報に関するお問い合わせ",
        text: "開示、訂正、利用停止等のお申し出があった場合には、所定の方法に基づき対応致します。具体的な方法については、個別にご案内しますので、お問い合わせください。",
    },
    {
        title: "Cookie（クッキー）",
        text: dedent`Cookie（クッキー）は、利用者のサイト閲覧履歴を、利用者のコンピュータに保存しておく仕組みです。
        利用者はCookie（クッキー）を無効にすることで収集を拒否することができますので、お使いのブラウザの設定をご確認ください。ただし、Cookie（クッキー）を拒否した場合、当サイトのいくつかのサービス・機能が正しく動作しない場合があります。`,
    },
    {
        title: "アクセス解析",
        text: dedent`当サイトでは、サイトの分析と改善のためにGoogleが提供している「Google アナリティクス」を利用しています。
        このサービスは、トラフィックデータの収集のためにCookie（クッキー）を使用しています。トラフィックデータは匿名で収集されており、個人を特定するものではありません。`,
    },
    {
        title: "著作権・肖像権",
        text: dedent`当サイトで掲載しているすべてのコンテンツ（文章、画像、動画、音声、ファイル等）の著作権・肖像権等は当サイト所有者または各権利所有者が保有し、許可なく無断利用（転載、複製、譲渡、二次利用等）することを禁止します。また、コンテンツの内容を変形・変更・加筆修正することも一切認めておりません。
        各権利所有者におかれましては、万一掲載内容に問題がございましたら、ご本人様よりお問い合わせください。迅速に対応いたします。`,
    },
    {
        title: "リンク",
        text: dedent`当サイトは原則リンクフリーです。リンクを行う場合の許可や連絡は不要です。引用する際は、引用元の明記と該当ページへのリンクをお願いします。
        ただし、画像ファイルへの直リンク、インラインフレームを使用したHTMLページ内で表示する形でのリンクはご遠慮ください。`,
    },
    {
        title: "本プライバシーポリシーの変更",
        text: dedent`当サイトは、本プライバシーポリシーの内容を適宜見直し、その改善に努めます。
        本プライバシーポリシーは、事前の予告なく変更することがあります。
        本プライバシーポリシーの変更は、当サイトに掲載された時点で有効になるものとします。`,
    },
]